{
  "spanish": [
    {
      "id": "-1",
      "text": "Hola mundo"
    },
    {
      "id": "0",
      "text": "Jugar"
    },
    {
      "id": "1",
      "text": "Opciones"
    },
    {
      "id": "2",
      "text": "Ayuda"
    },
    {
      "id": "3",
      "text": "Salir"
    },
    {
      "id": "4",
      "text": "Idioma"
    },
    {
      "id": "5",
      "text": "Español"
    },
    {
      "id": "6",
      "text": "Inglés"
    },
    {
      "id": "7",
      "text": "Variable"
    },
    {
      "id": "8",
      "text": "Espacio de memoria con un nombre propio.\nEj: VAR nombre;"
    },
    {
      "id": "9",
      "text": "Memoria"
    },
    {
      "id": "10",
      "text": "Lugar donde se almacenan los datos usados en un programa."
    },
    {
      "id": "11",
      "text": "Instrucción"
    },
    {
      "id": "12",
      "text": "Acción básica que puede reproducir un ordenador.\nEj: VAR suma=2+2\nsuma++ permite sumar 1 a las variables que tengan números en ellas;"
    },
    {
      "id": "13",
      "text": "Secuencia"
    },
    {
      "id": "14",
      "text": "Conjunto de instrucciones ordenadas.\nEj: \nVAR nombre;\nnombre = ENTRADA();\nSALIDA(\"Hola \" + nombre);"
    },
    {
      "id": "15",
      "text": "Programa"
    },
    {
      "id": "16",
      "text": "Secuencia de instrucciones con una tarea específica. Por ejemplo, las instrucciones ENTRADA o SALIDA son programas, pues necesitaron crearse con anterioridad"
    },
    {
      "id": "17",
      "text": "Entrada"
    },
    {
      "id": "18",
      "text": "Proceso por el que ser recibe información externa al programa, por ejemplo escribir un mensaje de texto o introducir una contraseña.\nEj: VAR nombre = ENTRADA();"
    },
    {
      "id": "19",
      "text": "Salida"
    },
    {
      "id": "20",
      "text": "Proceso por el que se emite información del programa al exterior, por ejemplo ver en la pantalla un dibujo o un mensaje que nos enviaron.\nEj: SALIDA(\"Hola mundo\");"
    },
    {
      "id": "21",
      "text": "Condicionales"
    },
    {
      "id": "22",
      "text": "Existen 3 tipos de condicionales: SI, SI NO...SI, SI NO.\nSI especifica que solo se ejecutará la/s secuencia/s si ocurre la condición establecida.Ej:VAR numero=2;SI numero==0\nSI NO...SI se usa para comprobar otras condiciones más específicas.Ej: SI NO...SI numero==1\nSI NO se pondrá al final del todo para especificar que pasa si no se cumple ninguna condición."
    },
    {
      "id": "23",
      "text": "Bucle simple"
    },
    {
      "id": "24",
      "text": "Un bucle simple se trata de una repetición de una acción infinitamente hasta que se termine el programa. No son comunes y deben utilizarse con cuidado.\nEj: \nVAR sumaInfinita;\nREPETIR {\nsumaInfinita = sumaInfinita + 1;\n}\nNunca terminará el bucle."
    },
    {
      "id": "25",
      "text": "Bucle condicional"
    },
    {
      "id": "26",
      "text": "Un bucle condiional reproduce una acción hasta que se cumpla una condición concreta.\nEj: VAR suma;\nREPETIR HASTA suma==3 {\nsuma = suma + 1;\n}\nEl valor de la variable suma será 3."
    },
    {
      "id": "27",
      "text": "Bucle finito"
    },
    {
      "id": "28",
      "text": "Los bucles finitos son aquellos que se repiten una cantidad de veces determinadas.\nEj: VAR suma;\nREPETIR 5 veces{\nsuma = suma + 1;\n}\nEl valor de la variable suma será 5."
    },
    {
      "id": "29",
      "text": "Descripciones"
    },
    {
      "id": "30",
      "text": "Elegir"
    },
    {
      "id": "31",
      "text": "Reordenar"
    },
    {
      "id": "32",
      "text": "Rellenar"
    },
    {
      "id": "33",
      "text": "Repaso"
    },
    {
      "id": "34",
      "text": "Jefe"
    },
    {
      "id": "35",
      "text": "¡Hola! Gracias por venir a Ciberespacio. ¡Necesito tu ayuda para recuperar el Nexo!"
    },
    {
      "id": "36",
      "text": "Me llamo Binary y te ayudaré a viajar por este complejo mundo."
    },
    {
      "id": "37",
      "text": "Aunque se me han olvidado algunas cosas... ¡las recordaremos juntos!"
    },
    {
      "id": "38",
      "text": "Lo primero es aprender a moverte por aquí. Pulsa las teclas de dirección o WASD para moverte."
    },
    {
      "id": "39",
      "text": "¡Genial! Puedes pulsar la barra espaciadora para saltar si lo necesitas."
    },
    {
      "id": "40",
      "text": "¡Guau! Vaya salto. Mira ese bloque de ahí. Puedes cogerlos o soltarlos si pulsas la tecla 'E'"
    },
    {
      "id": "41",
      "text": "También puedes lanzarlos con la tecla F."
    },
    {
      "id": "42",
      "text": "¡Bien hecho! Te has hecho con los controles en un momento."
    },
    {
      "id": "43",
      "text": "Ahora estamos preparados para recuperar el Nexo. Pero vamos a necesitar prestar atención."
    },
    {
      "id": "44",
      "text": "Para poder llegar a él, necesitaremos superar una serie de pruebas en Ciberespacio."
    },
    {
      "id": "45",
      "text": "¡Y no son nada fáciles! Necesitaremos aprender a programar código para superarlas."
    },
    {
      "id": "46",
      "text": "Y aunque no es tan complicado, es algo diferente. Te voy a dar unos consejos iniciales."
    },
    {
      "id": "47",
      "text": "Para empezar todo código se escribe y ejecuta de arriba abajo en una consola como esta."
    },
    {
      "id": "48",
      "text": "El orden es muy importante. Además, verás que todas las lineas terminan con ';'"
    },
    {
      "id": "49",
      "text": "VAR viene de Variable y se usa para especificar donde vamos a guardar datos con el nombre que le pongas. ¡Hay de muchos tipos!"
    },
    {
      "id": "50",
      "text": "Por ejemplo, puede contener texto entre comillas \"\". ¡Y si sumas dos variables con texto, se unirá el texto en si!"
    },
    {
      "id": "51",
      "text": "También puede contener números y ocurre lo mismo puedes operar con ellos."
    },
    {
      "id": "52",
      "text": "Se pueden realizar todo tipo de operaciones matemáticas: Sumas(+), restas(-), multiplicaciones(*) y divisiones (/)."
    },
    {
      "id": "53",
      "text": "Una más complicada es el valor booleano. Puede ser VERDADERO o FALSO. ¡0 o 1, como yo!"
    },
    {
      "id": "54",
      "text": "Cuando se ejecute un código, si tiene una SALIDA se mostrará en la parte inferior de la consola a parte de hacer las operaciones de arriba a abajo."
    },
    {
      "id": "55",
      "text": "Si tienes cualquier duda, no dudes en consultar el tutorial otra vez o la sección de Ayuda en el menú de pausa o menú principal."
    },
    {
      "id": "56",
      "text": "¡Vamos! ¡Hay un Nexo que recuperar y muchas cosas que aprender!"
    },
    {
      "id": "57",
      "text": "Antes de comenzar hay algo que explicar. En un código, a parte de las VARIABLES, existen las INSTRUCCIONES: Acciones simples que ejecuta el ordenador."
    },
    {
      "id": "58",
      "text": "En este mundo veremos sobretodo ENTRADA y SALIDA. ENTRADA es cuando le introducimos algo nosotros al ordenador."
    },
    {
      "id": "59",
      "text": "SALIDA es cuando el ordenador nos muestra algo por la consola. Todo esto lo puedes revisar en el menú de AYUDA."
    },
    {
      "id": "60",
      "text": "En este tipo de niveles debemos leer atentamente la descripción que aparece en consola y meter en el agujero el bloque que corresponda. ¡Acuerdate de que puedes coger con E y lanzar con F"
    },
    {
      "id": "61",
      "text": "¡Ah cierto! En estas fases debemos escoger cuál va a ser la SALIDA de la consola y meternos por el agujero correspondiente. ¡Hay que leer bien!"
    },
    {
      "id": "62",
      "text": "Creo recordar que en estas fases tenemos que ordenar los bloques para que tengan sentido en la consola. Cada color corresponde a una linea en ella. Acuerdate, E para coger, F para lanzar."
    },
    {
      "id": "63",
      "text": "En estos niveles debemos meter en la caja los bloques que correspondan fijándonos en la consola. Acuerdate, coger con E y lanzar con F."
    },
    {
      "id": "64",
      "text": "¡Ala! Estos niveles son un poco más largos. Nos servirá de repaso, ya que son todos los otros niveles juntos. ¡Pon aprueba todo lo que sabes!"
    },
    {
      "id": "65",
      "text": "Hm, creo que nos hemos equivocado de salida, la dirección no tiene sentido. Pone \"www.demasiadaswww.com\". Es como si alguien quisiera gastar una broma...#B"
    },
    {
      "id": "66",
      "text": "¡JAJAJAJA!¿HABEIS VISTO VUESTRAS CARAS? ERAN COMO...SI, ¡ASÍ! JAJAJAJA.#S"
    },
    {
      "id": "67",
      "text": "¡Oh no!¡Es SPAM! Le gusta mucho gastar bromas, molestar porque sí y engañar a las personas que navegan tranquilamente.#B"
    },
    {
      "id": "68",
      "text": "Y TAMBIÉN ME GUSTA GASTAR BROMAS.#S"
    },
    {
      "id": "69",
      "text": "Eso lo acabo de decir...#B"
    },
    {
      "id": "70",
      "text": "¡LO SE! JAJAJAJA, MIRA LA CARA QUE SE LE QUEDA AL PERRO ESTE#S"
    },
    {
      "id": "71",
      "text": "¡Basta! Estoy casi seguro de que eres quien está desetabilizando la red con alguna de tus bromas.#B"
    },
    {
      "id": "72",
      "text": "¿Y? ES MUY DIVERTIDO VER A A LA GENTE HACER CLICK DONDE NO DEBE JAJAJA#S"
    },
    {
      "id": "73",
      "text": "Seguro que algún dispositivo por esta sala... igual es esta máquina...#B"
    },
    {
      "id": "74",
      "text": "PUEDE. PERO PROBABLEMENTE NO SABREIS NI ENCENDERLA.#S"
    },
    {
      "id": "75",
      "text": "Ya está.#B"
    },
    {
      "id": "76",
      "text": "¡EH! DA IGUAL, TUS PATITAS PERRUNAS NO PODRÁN ACCEDER AL CÓDIGO.#S"
    },
    {
      "id": "77",
      "text": "Ahora es tu turno. Esta máquina es algo vieja y solo permite código escrito. ¡Así que habrá que acordarse de lo utilizado!#B"
    },
    {
      "id": "78",
      "text": "APUESTO A QUE NI SI QUIERA SABE CREAR UNA VARIABLE PARA LA NUEVA CONTRASEÑA JAJAJA.#S"
    },
    {
      "id": "79",
      "text": "JAJAJA, ¿VES? NI NUEVA NI CONTRASEÑA.#S"
    },
    {
      "id": "80",
      "text": "¡Vamos! Seguro que solo te falta alguna letra, ¿igual es por VAR o por contraseña?#B"
    },
    {
      "id": "81",
      "text": "¡EH! NO VALE. PERO DA IGUAL, SEGURO QUE NO SABES COMO RECOGER LA CONTRASEÑA ANTIGUA, AUNQUE TE LA ESCRIBA YO MISMO JAJAJA.#S"
    },
    {
      "id": "82",
      "text": "¡Ay! Seguro que falta algún paréntesis o algo en la entrada...#B"
    },
    {
      "id": "83",
      "text": "JAJAJA PERO QUE TORPE ES. NI UTILIZAR MI VARIABLE O LA ENTRADA()#S"
    },
    {
      "id": "84",
      "text": "¡Bien! Ahora tenemos su contraseña. Probemos a guardarla en nuestra variable por si borra algo.#B"
    },
    {
      "id": "85",
      "text": "¡Oh no! Algo no cuadra, debe de ser alguna palabra.#B"
    },
    {
      "id": "86",
      "text": "VENGA YA, NO TOQUES MÁS, NO IGUALES LAS VARIABLES, QUE TENGO QUE BORRARLA.#S"
    },
    {
      "id": "87",
      "text": "¡Y BORRADA! SI TE LO PERDISTE ES TU PROBLEMA.#S"
    },
    {
      "id": "88",
      "text": "Venga, solo queda mostrarle la contraseña al sistema y apagarlo.#B"
    },
    {
      "id": "89",
      "text": "NO ME PUEDO CREER QUE TODAVÍA NO CONSIGAS HACER UNA SALIDA.#S"
    },
    {
      "id": "90",
      "text": "¡Casi! Creo que la variable debería ir entre los paréntesis de SALIDA(), ¿verdad?#B"
    },
    {
      "id": "91",
      "text": "¡Vamos a ejecutar el código!#B"
    },
    {
      "id": "92",
      "text": "Oh vaya, ¿de verdad? Eso no es nada seguro.#B"
    },
    {
      "id": "93",
      "text": "EH, PERO NADIE SE LO ESPERA JAJAJA#S"
    },
    {
      "id": "94",
      "text": "¡Eh!¡Qué hay que evitar el colapso!#B"
    },
    {
      "id": "95",
      "text": "¡Di que SI!#B"
    },
    {
      "id": "96",
      "text": "¡NOOOOOOOOOOOOOOOOOOOOOOOO, CON LO QUE ME COSTÓ ENGAÑAR A TODO EL MUNDO!#S"
    },
    {
      "id": "97",
      "text": "¡Sí! Ahora deberíamos poder acceder a la siguiente parte del sistema. Esto le enseñará a SPAM a no fastidiar a los demás.#B"
    },
    {
      "id": "98",
      "text": "¡JO! SOLO QUERÍA DIVERTIRME.#S"
    },
    {
      "id": "99",
      "text": "¡Joo! Tenemos que poner más atención cuando volvamos. ¡Seguro que la siguiente lo conseguimos!#B"
    },
    {
      "id": "100",
      "text": "Uf, menos mal que ya salimos de la zona de SPAM... espero que esté por aquí el Nexo..."
    },
    {
      "id": "101",
      "text": "Parece que en este mundo nos vamos a encontrar los bloques de CONTROL, con CONDICIONALES. Si no recuerdo mal, esto funciona como el lenguaje natural. Usaremos \"SI\",\"SI NO, SI\" y \"SI NO\""
    },
    {
      "id": "102",
      "text": "El SI tiene que ir seguido de COMPARACIONES. Por ejemplo SI (2==3){} y dentro de las llaves la acción que va a ocurrir si se cumple. SI NO, SI(2==4){} funciona parecido, simplemente es otra condición extra. SI NO{} es el resto de opciones."
    },
    {
      "id": "103",
      "text": "Aquí debería estar otra de las terminales, como la que tenía SPAM... Necesitamos desactivarla para poder continuar.#B"
    },
    {
      "id": "104",
      "text": "¡Eeeeeh! Ni se os ocurra tocar mi terminal.#M"
    },
    {
      "id": "105",
      "text": "Ugh. Primero SPAM y ahora MISS...#B"
    },
    {
      "id": "106",
      "text": "Si, y no vais a tocar MI terminal. No hice nada malo. ¡Largo!#M"
    },
    {
      "id": "107",
      "text": "¡Pero necesitamos desactivarla para poder encontrar el Nexo!#B"
    },
    {
      "id": "108",
      "text": "No es mi problema. ¡Hasta luego!#M"
    },
    {
      "id": "109",
      "text": "¡No! Agh, como siempre. Lo único que sabe hacer es huir. ¡Vamos!#B"
    },
    {
      "id": "110",
      "text": "Vaya, habrá que decidirse por un camino. ¡Creo que la mejor manera sería usando la nueva terminal móvil!#B"
    },
    {
      "id": "111",
      "text": "Vale, ahora ya se puede tomar una decisión objetivamente. Con los bloques de control que aprendimos, podemos escoger el camino sin problemas.#B"
    },
    {
      "id": "112",
      "text": "Primero hay que escribir las variables, como siempre. La ENTRADA la escaneará la terminal. ¡Empecemos por el ancho del callejón!#B"
    },
    {
      "id": "113",
      "text": "Recuerdo que había que escribir una palabra antes del nombre de la variable...#B"
    },
    {
      "id": "114",
      "text": "Algo relacionado con variable... ¿VAR? Y el nombre, ¿no?#B"
    },
    {
      "id": "115",
      "text": "Perfecto. Yo puse la variable de las huellas para avanzar. Ahora necesitamos conseguir que la terminal rellene las variables...¿cómo era?#B"
    },
    {
      "id": "116",
      "text": "A ver, necesitamos algo del mundo anterior... si no es la SALIDA() debe de ser otra cosa.#B"
    },
    {
      "id": "117",
      "text": "Puede ser que había que igualar la variable a lo que recoge... ¿ENTRADA era?#B"
    },
    {
      "id": "118",
      "text": "¡Así si! Eso es perfecto, así el terminal podrá recoger la información. Ahora tenemos que programar los bloques de CONTROL.#B"
    },
    {
      "id": "119",
      "text": "Hay que pensar un poco. Si el ancho del callejón no es el de una persona, no vamos a escoger ese... empecemos por ahí.#B"
    },
    {
      "id": "120",
      "text": "Este es complicado, sí. Era algo como una condición... preguntar si el ancho es menor que una persona, como en matemáticas, con < ¿no?#B"
    },
    {
      "id": "121",
      "text": "Hmm... ¿Con SI? Y entre paréntesis las variables a comparar este caso ancho<persona... algo así.#B"
    },
    {
      "id": "122",
      "text": "¡Ahá! Que bien se nos da esto. Ahora tenemos que decir que es lo que pasa si hay huellas. Si no es el ancho, serán las huellas.#B"
    },
    {
      "id": "123",
      "text": "Este era un poco lioso, tenía que ver con SI pero había algo antes... pero aquí simplemente decir \"Hay(Huellas)\", pero falta algo seguro.#B"
    },
    {
      "id": "124",
      "text": "Era como SI NO, SI, ¿no?. Y luego lo que dije de antes entre paréntesis, creo.#B"
    },
    {
      "id": "125",
      "text": "¡Si! Jo, mira que era difícil, pero ya casi lo tenemos. Solo falta la última condición por si todo falla... creo que casi lo tenemos y todo.#B"
    },
    {
      "id": "126",
      "text": "¡Ay! Solo falta un detalle, creo que estaba en lo anterior también, pero sin el SI...#B"
    },
    {
      "id": "127",
      "text": "Debe ser algo....¿SI NO? Puede ser... pero creo que no hace falta nada más.#B"
    },
    {
      "id": "128",
      "text": "¡Bien! Ya debería estar todo. La terminal rellenará con los programas necesarios esta vez. ¡No nos acostumbremos! Veamos.#B"
    },
    {
      "id": "129",
      "text": "Mira, es por la izquierda, ¡vamos!#B"
    },
    {
      "id": "130",
      "text": "¡Te pillamos, MISS! Danos ese terminal ahora mismo.#B"
    },
    {
      "id": "131",
      "text": "¡AH!¡Qué susto! Tomad si quereis...#M"
    },
    {
      "id": "132",
      "text": "¿Así tan fácil? ¿Entonces por que saliste corriendo?#B"
    },
    {
      "id": "133",
      "text": "Si, es vuestra... me perseguíais y me asusté...#M"
    },
    {
      "id": "134",
      "text": "...#B"
    },
    {
      "id": "135",
      "text": "...#M"
    },
    {
      "id": "136",
      "text": "En fin... vamos a reparar el núcleo de esta zona y vayamos a por el Nexo.#B"
    },
    {
      "id": "137",
      "text": "¿Me devolvéis el terminal luego...?#M"
    },
    {
      "id": "138",
      "text": "¿No...?#B"
    },
    {
      "id": "139",
      "text": "Jo...#M"
    },
    {
      "id": "140",
      "text": "Jo, casi lo conseguimos. La proxima vez que volvamos, seguro que lo hacemos genial. ¡Vamos a prestar más atención y a repasar un poquito.#M"
    },
    {
      "id": "142",
      "text": "Aquí parece que están los BUCLES. Son un poco liosos al principio, pero se parecen mucho al mundo real. Usaremos \"REPETIR\" en todos y luego depende del tipo de bucle"
    },
    {
      "id": "143",
      "text": "Por ejemplo, los BUCLES FINITOS deben ser \"REPETIR X VECES\" donde X es un número entero como 1,2,3, etc. Los BUCLES INFINITOS solo van con \"REPETIR\" pero son raros"
    },
    {
      "id": "144",
      "text": "Los BUCLES CONDICIONALES son los que deben cumplir una condición para parar. Por ejemplo \"REPETIR HASTA año==2020\" si tuvieramos una variable año que sumase. Acuerdate que podemos usar variable++ para sumar de 1 en 1."
    },
    {
      "id": "145",
      "text": "¡Por fin! ¡El Nexo está cerca! Tenemos que acercarnos para arreglarlo, la terminal portátil no capta la señal desde aquí.#B"
    },
    {
      "id": "146",
      "text": "¿Y si llego yo antes?#V"
    },
    {
      "id": "147",
      "text": "Agh. Estoy hasta el hocico, ¡dejadnos arreglar este desastre! Primero SPAM, después MISS y ahora VIRUS.#B"
    },
    {
      "id": "148",
      "text": "Me imaginaba que no os pararían, así que vine yo por mi cuenta a solucionarlo.#V"
    },
    {
      "id": "149",
      "text": "¿Por qué habéis molestado a todo el mundo fastidiando la red?#B"
    },
    {
      "id": "150",
      "text": "¿Y por qué no? Todo el mundo parece divertirse, pero nosotros no podemos, ¿no? Pff pues os vais a enterar. Llegaré al Nexo antes y lo esconderé muy bien.#V"
    },
    {
      "id": "151",
      "text": "¡Qué te lo has creido! Creo que necesitaremos ir un poco más rápido... ya lo tengo.#B"
    },
    {
      "id": "152",
      "text": "Con lo que hemos aprendido, ya puedo programar casi tan bien como tú. ¡Vamos!#B"
    },
    {
      "id": "153",
      "text": "¡JA JA JA! Ahora es mío y no dejaré que os lo llevéis.#V"
    },
    {
      "id": "154",
      "text": "Grrr, ¡Eso habrá que verlo!#B"
    },
    {
      "id": "155",
      "text": "Pues ya veréis. ¡Os voy a lanzar todo lo que tengo!#V"
    },
    {
      "id": "156",
      "text": "¡EH!#B"
    },
    {
      "id": "157",
      "text": "¡Pero seguro que no sabeis que también tengo esto!#V"
    },
    {
      "id": "158",
      "text": "Uf, por los pelos.#B"
    },
    {
      "id": "159",
      "text": "¡Pero a que no sabes que tengo 10 más!#V"
    },
    {
      "id": "160",
      "text": "¡Venga ya! Vamos a hacer un programa para esquivarlas mientras se prepara. Como siempre, necesitaremos una variable primero. En este caso para el color de las esferas que lanza#B"
    },
    {
      "id": "161",
      "text": "Este es sencillo, lo hacemos todo el rato... algo con variable y el color.#B"
    },
    {
      "id": "162",
      "text": "Ay, claro, era algo con VAR y después un nombre significativo, como color, ¿verdad?#B"
    },
    {
      "id": "163",
      "text": "Perfecto, ahora necesitaremos un BUCLE. De los que son hacer algo una cantidad de veces y ya está. Dijo que iban a ser... ¡10!#B"
    },
    {
      "id": "164",
      "text": "Este es difícil, sí. Creo que hay que indicarle las veces que debe REPETIR...#B"
    },
    {
      "id": "165",
      "text": "Agh, está complicandose, era... REPETIR y número VECES, ¿no?#B"
    },
    {
      "id": "166",
      "text": "¡Bien! Ahora tenemos que hacer algo un poco más complicado. Debemos esquivar las bolas rojas...eso será con un CONDICIONAL, ¿no?#B"
    },
    {
      "id": "167",
      "text": "Vaya, seguro que es la condición de SI y depende del color...#B"
    },
    {
      "id": "168",
      "text": "Claro, debe de ser algo como SI el color el rojo... pero en código.#B"
    },
    {
      "id": "169",
      "text": "Ahora si. Solo falta decir que pasa si son azules... ¡vamos!#B"
    },
    {
      "id": "170",
      "text": "Venga, casi lo tenemos. Es la otra parte de los condicionales. Como era... SI algo no pasa, entonces...#B"
    },
    {
      "id": "171",
      "text": "Hm, SI NO son bolas rojas seguro que son azules... debe de ser eso.#B"
    },
    {
      "id": "172",
      "text": "¡Bien! Ahora puede lanzarnos las esferas que quiera, que las esquivaremos sin mirar, verás.#B"
    },
    {
      "id": "173",
      "text": "¡AHORA!#B"
    },
    {
      "id": "174",
      "text": "¡NOOOOO!#V"
    },
    {
      "id": "175",
      "text": "¡NOOOO! Estuve tan cerca de ser libre... la próxima vez será mía.#V"
    },
    {
      "id": "176",
      "text": "¡Si! Por fin tenemos el Nexo. Ahora podemos arreglar todos los problemas que causaron VIRUS, SPAM y MISS.#B"
    },
    {
      "id": "177",
      "text": "¡Bien! Muchas gracias. Sin ti no hubiese podido restaurar el orden en la RED. Hemos aprendido un montón, ¿verdad? ¡Y lo mejor es que en el mundo real se puede usar!#B"
    },
    {
      "id": "178",
      "text": "¡Puedes llegar a ser un programador increíble si así lo quieres! Te deseo mucha suerte y seguro que nos volvemos a ver. ¡Muchas gracias!#B"
    },
    {
      "id": "179",
      "text": "Oof, esto es complicado. Vamos a replantearnos la situación y volvamos a intentarlo otra vez.#B"
    },
    {
      "id": "400",
      "text": "Volver"
    },
    {
      "id": "401",
      "text": "Cerrar"
    }
  ],
  "english": [
    {
      "id": "-1",
      "text": "hello world"
    },
    {
      "id": "0",
      "text": "Play"
    },
    {
      "id": "1",
      "text": "Settings"
    },
    {
      "id": "2",
      "text": "Help"
    },
    {
      "id": "3",
      "text": "Èxit"
    },
    {
      "id": "4",
      "text": "Language"
    },
    {
      "id": "5",
      "text": "Spanish"
    },
    {
      "id": "6",
      "text": "English"
    },
    {
      "id": "400",
      "text": "Back"
    },
    {
      "id": "401",
      "text": "Close"
    }
  ]
}
